<template>
  <div class="main-container">
    <form action="/">
      <input type="text" />
      <button @submit.prevent="buttonCheck">Поиск</button>
    </form>
  </div>
  <div class="anime-list-container">
    <p class="anime-list-description-first">
      Аниме - это искусство мультипликации зародилось еще в XX в. на Востоке, в
      далекой Японии. Но что удивительно, своим названием этот жанр обязан вовсе
      не японскому слову. Как вы уже догадались, слово «аниме» это всего лишь
      сокращение от английского «animation», которое получило успешное
      распространение из-за своей простоты произношения. Однако, не нужно
      торопиться. Ведь именно познав простоту и легкость этого удивительного
      жанра, вы возможно познаете себя. Японская анимация обладает качественными
      отличиями от своих европейских собратьев. Все дело в особом менталитете и,
      конечно же, оригинальной рисовке. Приведу простой пример, в мультфильмах
      очень часто можно встретить персонажей, которые выражают свои эмоции в
      скрытой форме (японцы замкнутый и скрытый по натуре народ, но при этом они
      вежливые и гостеприимные, но их широта души не равна русской, так что
      осторожнее). Не только это до сих пор заставляет поклонников аниме
      смотреть все новые и новые серии, а некоторые даже собираются на особые
      фестивали в честь своего увлечения и устраивают костюмированное
      шоу-косплей.
    </p>
    <p class="anime-list-description-second">
      Вторым условием для просмотра этих мультфильмов я считаю детальную
      прорисованность и, как следствие, восхитительное качество фильма налицо.
      Популярность аниме и аниме-сериалов к настоящему времени сильно возросла.
      Даже трудно сказать, что сейчас популярнее манга онлайн или аниме онлайн.
      Но все же одно я могу сказать точно, что в интернете сейчас полным-полно
      сайтов, где куча материалов по вышеизложенной мною теме. Кстати, я считаю
      не лишним предложить вам посетить молодой проект a105.animevost.top
      (АнимеВостОрг). Это полное собрание уже переведенных на русский язык
      аниме, плюс описания к ним. Для комфортного просмотра на сайте сделан
      удобный плеер, функционал которого приятно удивляет в самый подходящий
      момент.
    </p>
  </div>
  <div>
    <base-card>
      <anime-list-data></anime-list-data>
    </base-card>
  </div>
</template>

<script>
import AnimeListData from '../Data/AnimeListData.vue';
export default {
  components: {
    AnimeListData,
  },
  methods: {
    buttonCheck() {
      console.log('i submited');
    },
  },
};
</script>

<style scoped>
.anime-list-description-first {
  margin-top: 0px;
  padding: 20px 20px 0 20px;
  font-size: 20px;
}
.anime-list-description-second {
  margin-top: 0;
  padding: 0 15px 20px 20px;
  font-size: 20px;
}
.anime-list-container {
  background-color: rgb(148, 169, 233);
  border-radius: 24px;
}
</style>
